{"name":"Dispin","engine":"unity","type":"games","tags":["gamejam","team-project"],"thumbnail":"https://imgur.com/NbWNqA4.gif","summary":"Contrôlez un dé, déclenchez des power-ups et dominez une boîte de nuit remplie d’ennemis.","article":"<p class=\"ql-align-center\"><strong>Je suis fier de vous présenter DiSpin, un jeu innovant développé lors d'une <u>game jam</u> avec pour thème \"Dice\".</strong></p><p><br></p><p class=\"ql-align-center\"><strong class=\"ql-size-large\">[VIDÉO TRAILER]</strong></p><p><br></p><h3 class=\"ql-align-center\"><strong class=\"ql-size-large\">Pitch</strong></h3><p class=\"ql-align-center\"><br></p><p><strong>DiSpin</strong> est un jeu où vous contrôlez un dé à 6 faces en l'expulsant comme une balle de mini-golf. Une fois arrêté, la face supérieure indique le power-up à utiliser instantanément. Les pouvoirs incluent Attraction, Destruction, Ajout de PV, Ajout d'énergie, Grossissement, et Écarter les ennemis. Le joueur évolue dans une boîte de nuit, traversant des salles remplies de fuyards, bloqueurs et ennemis, en se dirigeant vers la salle de boss.</p><p><br></p><p>Ce projet m'a permis d'explorer plusieurs rôles clés : <strong>Level Designer</strong>, et <strong>Game Designer</strong>. Voici un aperçu détaillé de mon travail et de mes contributions à ce jeu unique :</p><p><br></p><h3>Mon Rôle en tant que Level Designer__</h3><p>En tant que <strong>Level Designer</strong>, ma mission était de créer des niveaux captivants et bien équilibrés, offrant un défi progressif aux joueurs :</p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Conception des Pièces/Salles</strong> : J'ai conçu chaque salle pour offrir une variété de défis, en plaçant stratégiquement les fuyards, bloqueurs et ennemis. Chaque salle a été pensée pour exploiter au mieux les différentes faces du dé et leurs pouvoirs spécifiques.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Équilibrage des Ennemis et Objets</strong> : J'ai veillé à ce que les types d'entités soient bien répartis pour maintenir l'équilibre du jeu. Les fuyards devaient inciter le joueur à les pourchasser pour regagner de l'énergie, les bloqueurs créaient des obstacles stratégiques, et les ennemis ajoutaient une menace constante.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Création de l'Arène de Boss</strong> : La salle de boss, une arène avec des vagues successives d'ennemis, a été conçue pour tester les compétences acquises par le joueur tout au long des niveaux précédents. Elle nécessitait une utilisation judicieuse de tous les power-ups pour survivre.</li></ol><p><br></p><h3>Mon Rôle en tant que Game Designer__</h3><p>En tant que <strong>Game Designer</strong>, j'ai conceptualisé et peaufiné les mécaniques de jeu pour offrir une expérience cohérente et addictive :</p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Mécaniques de Contrôle</strong> : Le contrôle du dé par étirement et lâcher devait être intuitif et réactif, permettant aux joueurs de se déplacer avec précision et stratégie. J'ai travaillé sur les paramètres de physique pour garantir un gameplay satisfaisant.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Système de Power-ups</strong> : La conception des 6 pouvoirs spécifiques a nécessité une réflexion approfondie pour assurer leur utilité et leur équilibre. Chaque power-up devait être immédiatement reconnaissable et offrir un avantage tactique pertinent.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Conception et Itération de la Résolution de l'Écran</strong> : J'ai également conçu et itéré la résolution de l'écran pour des raisons de direction artistique et de design. L'objectif était de maintenir l'idée de cube et de carré, en lien avec le dé, tout en répondant aux contraintes techniques. En effet, un écran plus large permettait au joueur de prendre plus d'élan et de se déplacer plus rapidement sur les côtés. Cette itération a permis de maintenir un équilibre visuel et mécanique cohérent.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Intégration de l'Ambiance</strong> : L'ambiance techno et house de la boîte de nuit était essentielle pour l'immersion. J'ai collaboré étroitement avec les sound designers pour synchroniser les animations, les effets visuels et la musique, créant une expérience harmonieuse et énergique.</li></ol><p><br></p><h3>Pour conclure__</h3><p>Travailler sur <strong>DiSpin</strong> a été une expérience enrichissante qui m'a permis d'explorer et de développer mes compétences dans plusieurs domaines du développement de jeux vidéo. En tant que <strong>Level Designer</strong> et <strong>Game Designer</strong>, j'ai contribué à créer un jeu dynamique et immersif, offrant une expérience unique aux joueurs. Ce projet a renforcé ma passion pour le design de jeux et m'a donné de précieuses leçons pour mes futurs projets. Pour toute question ou discussion sur le développement de jeux, n'hésitez pas à me contacter.</p>"}