{"name":"Infiltration (LD)","engine":"unreal-engine","type":"level-design","tags":["solo-project"],"thumbnail":"Screen Styx2.jpg","summary":"Voici un Level design dans un style d'infiltration du jeu Styx.","article":"<p class=\"ql-align-center\"><strong class=\"ql-size-large\">Sujet</strong></p><p class=\"ql-align-center\"><em><u>Vous avez rejoins une équipe qui veut faire un jeu d'infiltration. Sa principale inspiration est la licence Styx.</u></em></p><p class=\"ql-align-center\"><em><u>Donc un jeu d'infiltration dans le Medieval Fantastique.</u></em></p><p class=\"ql-align-center\"><br></p><p class=\"ql-align-center\"><em><u>Ils vous présentent ce niveau comme une cité en ruine.</u></em></p><p class=\"ql-align-center\"><em><u>Il s'agit d'un premier jet de blocking, absent d'IA et c'est normal. Elles sont encore en cours de développement.</u></em></p><p><br></p><p class=\"ql-align-center\"><strong>[Vidéo Test du niveau]</strong></p><p><br></p><p><strong>Introduction</strong></p><p>En tant que Level Designer passionné, j'ai eu l'opportunité de travailler sur un projet d'infiltration inspiré par la licence <em>Styx</em>, un jeu se déroulant dans un univers médiéval fantastique. Ce projet, réalisé dans le cadre de mes études de Level Design, a été conçu en l'espace de <u>trois semaines</u>. Mon travail s'est concentré sur la création d'un niveau en blocking, conçu pour immerger le joueur dans une cité en ruine. Dans cet article, je vais détailler chaque étape du processus itératif et de conception de ce projet, en mettant en avant les choix techniques et créatifs qui ont guidé mon travail.</p><p><br></p><p><strong>Analyse du Genre et Gameplay Core__</strong></p><p>La première étape de la conception a été de comprendre en profondeur les core gameplays du genre infiltration. J'ai identifié trois piliers principaux pour ce type de jeu : l'exploration, l'infiltration/discrétion, et l'assassinat.</p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Exploration :</strong> Le joueur doit avoir la liberté de découvrir de nouvelles zones et de choisir son chemin. Pour cela, j'ai conçu des environnements offrant plusieurs routes, chacun avec des défis uniques pour encourager l'exploration.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Infiltration/Discrétion :</strong> La conception du niveau a été orientée autour de la furtivité. J'ai créé des zones avec des niveaux de difficulté variables, offrant un rythme dynamique au gameplay. Les ennemis ont été placés de manière stratégique pour forcer le joueur à utiliser ses compétences de discrétion.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Assassinat :</strong> J'ai soigneusement positionné les ennemis pour offrir des opportunités d'assassinat variées, évitant à la fois la monotonie et la facilité excessive, ce qui permet de maintenir l'intérêt du joueur tout au long du niveau.</li></ol><p><br></p><p><br></p><p><strong>Conception du Niveau__</strong></p><p>La conception du niveau a été divisée en plusieurs zones distinctes, chacune ayant un rôle précis dans l'apprentissage et la progression du joueur.</p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Zone 0 (Spawn):</strong> Le joueur débute avec une vue d'ensemble du niveau (Vista) tout en apprenant les bases du saut et du crouch. L'idée est d'introduire progressivement les mécaniques essentielles sans submerger le joueur dès le début.</li></ol><p>[image]</p><p><br></p><p><br></p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Zone 1 (Maisonette):</strong> Le joueur est confronté à ses premiers défis légers de saut et de discrétion. Cette zone sert également à introduire la structure du niveau, en offrant des vues anticipées des futures zones, permettant au joueur de commencer à planifier sa stratégie.</li></ol><p>[image]</p><p><br></p><p><br></p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Zone 2 (Introduction au kill et à la discrétion):</strong> Ici, le joueur rencontre ses premiers ennemis avec des patrouilles simples. Cela permet d'introduire les concepts de base de l'assassinat et de la furtivité, tout en maintenant une pression modérée pour ne pas frustrer le joueur dès le départ.</li></ol><p>[image]</p><p><br></p><p><br></p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Zone 3 (Décombres sous la Maisonette):</strong> Cette zone complexe offre une pratique de la discrétion et de l'assassinat. Le joueur peut choisir entre plusieurs chemins et doit utiliser ses compétences de saut et d'observation pour progresser sans être détecté. Ceux qui explorent suffisamment trouveront des zones cachées avec des récompenses.</li></ol><p>[image]</p><p><br></p><p><br></p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Zone 4 (Discrétion et Récompenses):</strong> J'ai conçu cette zone pour inciter le joueur à prendre des risques en explorant, avec la promesse de récompenses sous forme d'items. Cela encourage une exploration plus approfondie du niveau tout en maintenant l'enjeu de rester discret.</li></ol><p>[image]</p><p><br></p><p><br></p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Zone 5-10 (Escalade de la difficulté):</strong> Au fur et à mesure que le joueur progresse, les défis augmentent en complexité. Les zones 5 à 10 incluent des défis d'orientation, de saut, et des confrontations plus difficiles avec des ennemis plus alertes. Le joueur doit prouver sa maîtrise des mécaniques apprises tout au long du niveau pour déverrouiller la porte finale et atteindre la fin du niveau.</li></ol><p>[image]</p><p><br></p><p><br></p><p><br></p><p><strong>Processus Itératif et Grey Blocking__</strong></p><p>Le développement de ce niveau a suivi un processus itératif rigoureux, passant par plusieurs phases de <em>grey blocking</em>. Cette méthode m'a permis de tester les volumes, la circulation, et les mécaniques de gameplay avant d'entrer dans les détails esthétiques. Chaque itération a été basée sur les retours des tests internes, avec un focus sur l'amélioration de l'expérience du joueur.</p><p><br></p><p><br></p><p><strong>Conclusion__</strong></p><p>Ce projet a été une formidable opportunité pour continuer mon apprentissage en Level design. En combinant une compréhension approfondie des mécaniques d'infiltration et un processus de design itératif, j'ai pu créer un niveau qui non seulement met au défi le joueur, mais l'immerge également dans un monde interactif. Mon travail sur ce projet reflète ma capacité à concevoir des environnements enrichissent l'expérience de jeu et je suis impatient de poursuivre ce cheminement dans mes futurs projets.</p>"}