{"name":"NetRunners","engine":"unity","type":"games","tags":["team-project"],"thumbnail":"netrunners.png","summary":"Plongez dans Netrunners, un jeu d'action rythmée où vous incarnez un hacker futuriste, naviguant dans un métavers à travers des parcours de parkour intenses, le tout synchronisé à une musique immersive.","article":"<h3 class=\"ql-align-center\"><span class=\"ql-size-large\">Netrunners</span></h3><h3 class=\"ql-align-center\">Mon Expérience en Tant que Level Designer et 3D Texturer</h3><p class=\"ql-align-center\"><br></p><p class=\"ql-align-center\">https://youtu.be/OfgPeqDu7xs</p><p class=\"ql-align-center\"><br></p><h3>Introduction au Projet Netrunners__</h3><p>Netrunners est un projet semestriel de deuxième année de Bachelor en Game Design, développé sur quatre mois autour du thème imposé : le rythme. Ce jeu se situe dans un futur proche où l'on incarne un jeune hacker naviguant dans un métavers, une réalité virtuelle utilisée comme nouvelle interface pour internet. Le joueur doit se déplacer de gratte-ciel en gratte-ciel pour récolter des informations, en utilisant des compétences de parkour et de tir synchronisées avec une musique rythmée.</p><p><br></p><p class=\"ql-align-center\">[Image]\t\t\t[Image]\t\t\t[Image]\t\t\t[Image]</p><p class=\"ql-align-center\"><br></p><h3>Mon Rôle en Tant que Level Designer__</h3><p>En tant que Level Designer pour Netrunners, j'avais la responsabilité de concevoir des niveaux dynamiques et captivants qui intègrent harmonieusement les éléments de rythme et de gameplay. Mon travail s'est concentré sur la création d'environnements qui encouragent le mouvement continu et l'engagement du joueur.</p><p><strong>Détails du Travail de Level Design :</strong></p><ol><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Conception des Parcours :</strong>Création de niveaux complexes où les joueurs doivent utiliser des compétences comme le dash, le wallrun et la glissade pour naviguer à travers des obstacles et des ennemis.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span>Synchronisation des mouvements du joueur avec la musique pour maintenir un flux constant et immersif.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Intégration du Rythme :</strong>Conception des niveaux en accord avec le tempo de la musique choisie, garantissant que chaque action du joueur, qu'il s'agisse de tirer ou de se déplacer, soit en rythme.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span>Utilisation des feedbacks visuels et sonores pour renforcer la synchronisation du joueur avec la musique.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Équilibrage et Difficulté :</strong>Placement stratégique des ennemis et des obstacles pour équilibrer la difficulté et maintenir un défi constant pour le joueur.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span>Ajustement des checkpoints pour minimiser la frustration tout en offrant un défi significatif.</li></ol><p><br></p><p class=\"ql-align-center\">[Image]\t\t [Image] \t\t[Image] \t\t[Image]</p><p><br></p><h3>Mon Rôle en Tant que 3D Texturer</h3><p>En tant que 3D Texturer, j'ai été responsable de la création et de l'application des textures sur les différents éléments 3D du jeu. Mon objectif était de rendre les environnements et les personnages visuellement attrayants tout en restant cohérents avec le style artistique du jeu.</p><p><strong>Détails du Travail de 3D Texturer :</strong></p><ol><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Création des Textures :</strong>Développement de textures détaillées pour les surfaces des bâtiments, les objets et les personnages, en s'assurant qu'elles s'intègrent bien dans l'univers cyberpunk du jeu.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span>Utilisation de logiciels de création de textures pour produire des surfaces réalistes et stylisées.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Application des Textures :</strong>Application précise des textures sur les modèles 3D pour garantir une qualité visuelle optimale.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span>Collaboration étroite avec les artistes 3D pour s'assurer que les textures s'adaptent correctement aux modèles et ne présentent pas de défauts.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Optimisation :</strong>Optimisation des textures pour garantir des performances fluides sans compromettre la qualité visuelle.</li><li data-list=\"bullet\" class=\"ql-indent-1\"><span class=\"ql-ui\" contenteditable=\"false\"></span>Réduction des tailles de fichiers et utilisation de techniques de mip-mapping pour améliorer les performances.</li></ol><p><br></p><h3>Conclusion__</h3><p>Travailler sur Netrunners a été une expérience précieuse qui m'a permis de développer et de combiner mes compétences en Level Design et en texturation 3D. Ce projet m'a non seulement appris à créer des environnements immersifs et à synchroniser le gameplay avec la musique, mais aussi à surmonter les défis techniques et artistiques. Malgré les difficultés rencontrées, telles que les problèmes de gestion de projet, cette expérience m'a permis de grandir en tant que professionnel et d'améliorer ma capacité à m'adapter et à diriger un projet de jeu vidéo.</p>"}