{"name":"Sherlock golm's","engine":"unity","type":"games","tags":["gamejam","team-project"],"thumbnail":"https://imgur.com/OBFiI90.gif","summary":"Dirigez des golems avec des runes pour résoudre des puzzles complexes dans ce jeu de réflexion captivant.","article":"<p class=\"ql-align-center\"><strong>Je suis heureux de vous présenter mon travail sur le projet Sherlock Golm’s, un puzzle game en vue top-down, réalisé lors d'une jam.</strong></p><iframe class=\"ql-video\" frameborder=\"0\" allowfullscreen=\"true\" src=\"https://www.youtube.com/embed/4yG1Uj9QjfM?showinfo=0\"></iframe><p class=\"ql-align-center\"><br></p><p><br></p><h3 class=\"ql-align-center\"><span class=\"ql-size-large\">Pitch</span></h3><p class=\"ql-align-center\"><br></p><p><strong>Sherlock Golm’s</strong> est un jeu de réflexion où les joueurs doivent utiliser leur observation et leur déduction pour préparer et donner des ordres à des golems grâce à des pierres runiques. Ces ordres permettent de résoudre des puzzles et de progresser à travers les niveaux.</p><p><br></p><p><br></p><p><br></p><p><br></p><p>En tant que <strong>Level Designer</strong> et <strong>contributeur à l'UI</strong>, j'ai eu l'occasion de mettre en pratique et d'affiner mes compétences en design de jeu. Voici un aperçu détaillé de mes contributions à ce projet :</p><p><br></p><h3>Mon Rôle en tant que Level Designer__</h3><p>En tant que <strong>Level Designer</strong>, mes responsabilités principales étaient de concevoir des niveaux logiques et progressifs tout en tenant compte des principes de <strong>Rational Level &amp; Game Design (RLD et RGD)</strong>. Voici les éléments clés de mon approche :</p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Enchaînement Logique des Niveaux</strong> : J'ai veillé à ce que les défis proposés aux joueurs progressent de manière logique, sans transitions brusques entre des niveaux de difficulté différente. Chaque nouveau challenge était introduit progressivement pour que les joueurs puissent s'adapter et maîtriser les nouvelles mécaniques de jeu.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Progression de la Difficulté</strong> : J'ai conçu une courbe de difficulté croissante, où chaque niveau devenait de plus en plus complexe. Cette progression était essentielle pour maintenir l'intérêt des joueurs et les encourager à améliorer leurs compétences.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Teasing des Nouveaux Éléments de Gameplay</strong> : J'ai intégré des éléments de gameplay futurs de manière subtile dans les niveaux précédents pour préparer les joueurs aux défis à venir. Cela permettait de maintenir une anticipation et une curiosité constantes.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Transitions de Niveau</strong> : Les transitions entre les niveaux étaient conçues pour offrir une satisfaction visuelle sans difficulté supplémentaire. Ces phases de transition servaient également à teaser les prochains éléments de gameplay.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Liberté de Résolution des Puzzles</strong> : J'ai essayé de laisser au maximum la liberté aux joueurs de trouver leur propre manière de résoudre les puzzles. Les emplacements vides laissés après la résolution d'un puzzle apportaient une grande satisfaction au joueur, renforçant l'idée d'avoir trouvé une solution unique.</li></ol><p><br></p><p><br></p><h3>Création des Niveaux__</h3><p>La création des niveaux impliquait plusieurs étapes clés :</p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Conception des Challenges</strong> : Je déterminais d'abord le type de défi à proposer au joueur, en utilisant divers éléments de gameplay (par exemple, blocs glissants, téléporteurs, etc.). La longueur et la complexité du chemin à parcourir par les golems étaient des facteurs cruciaux pour la difficulté du niveau.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Dessins Préliminaires</strong> : Je réalisais rapidement des esquisses de chemins simples et complexes pour avoir un éventail de difficultés. Cette étape permettait d'ajuster les designs en fonction des besoins de gameplay.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Définition des Runes et des Emplacements</strong> : En fonction du chemin à réaliser, je choisissais les runes à disposition du joueur et les emplacements disponibles. L'objectif était de proposer des options de résolution non linéaires, permettant aux joueurs de trouver plusieurs solutions possibles.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Psychologie Inversée</strong> : Dans certains niveaux, j'ai introduit des runes destinées à induire en erreur le joueur, encourageant ainsi l'expérimentation et la découverte de solutions alternatives. Cela a contribué à créer une communauté de joueurs partageant leurs découvertes et incitant les autres à essayer de nouvelles approches.</li></ol><p><br></p><p><br></p><h3>Mon Rôle en tant que Contributeur à l'UI__</h3><p>En plus de mes responsabilités de <strong>Level Designer</strong>, j'ai également participé à la conception de l'interface utilisateur (UI) du jeu. Mon objectif était de :</p><ol><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Assurer une Interface Intuitive</strong> : L'UI devait être claire et facile à comprendre pour que les joueurs puissent se concentrer sur la résolution des puzzles sans être distraits par des éléments de design complexes.</li><li data-list=\"bullet\"><span class=\"ql-ui\" contenteditable=\"false\"></span><strong>Faciliter l'Interaction</strong> : J'ai veillé à ce que les interactions avec les runes et les golems soient fluides et intuitives, permettant aux joueurs de donner des ordres facilement et de voir le résultat de leurs actions sans confusion.</li></ol><p><br></p><p><br></p><h3>Pour conclure__</h3><p>Travailler sur <strong>Sherlock Golm’s</strong> a été une expérience enrichissante qui m'a permis de développer mes compétences en <strong>Level Design</strong> et en <strong>UI Design</strong>. La création de niveaux progressifs, logiques et engageants, combinée à une interface utilisateur intuitive, a été au cœur de mon approche. Ce projet m'a appris l'importance de la planification minutieuse et de l'attention aux détails pour offrir une expérience de jeu satisfaisante et immersive.</p>"}